#include <iostream>
#include <vector>

//Идея:
//ще запазваме индекса на най-лявата нула (idx), след което
//ще я разменяме с първия срещнат елемент, различен от 0

//Пример: 
//0 1 12 0 3
//Итерация i = 0:
//тъй като v[0] e 0, няма да влезем в if-a и idx ще остане 0 
//(което е индекса на най-лявата 0)

//Итерация i = 1:
//тъй като v[1] е 1, влизаме в if-a и разменяме 
//най-лявата 0 с първия намерен елемент, различен от 0
//idx++ 
//(вече нулата не е на същото място и започваме 
//да търсим следващата най-лява нула)

//...

void moveZeroes(std::vector<int>& v)
{
 
	int idx = 0;
	for (int i = 0; i < v.size(); i++)
	{
		if (v[i] != 0)
		{
			std::swap(v[i], v[idx]);
			idx++;
		}
	}
}